In [8]:
database={'James':{ 'Register Number': '2140229', 'Marks': marks[0], 'Percentage': per[0]},
          'Joseph':{ 'Register Number': '2140260', 'Marks': marks[0], 'Percentage': per[1]}   }
print(database)

{'James': {'Register Number': '2140229', 'Marks': [94, 96, 84, 92], 'Percentage': 91.5}, 'Joseph': {'Register Number': '2140260', 'Marks': [94, 96, 84, 92], 'Percentage': 89.75}}

In [12]:
database['James']['Percentage']

91.5

In [15]:
database={'James':{ 'Register Number': '2140229', 'Marks': marks[0], 'Percentage': per[0]},
          'Joseph':{ 'Register Number': '2140260', 'Marks':{'Science': marks[1][0],'Maths': marks[1][1], 'English': marks[1][2], 'Elective': marks[1][3]}, 'Percentage': per[1]}}
print(database)

{'James': {'Register Number': '2140229', 'Marks': [94, 96, 84, 92], 'Percentage': 91.5}, 'Joseph': {'Register Number': '2140260', 'Marks': {'Science': 86, 'Maths': 89, 'English': 94, 'Elective': 90}, 'Percentage': 89.75}}

In [17]:
d={'Name':['Akshat','Apurva','Janhvi','Somesh','Yash'],'Regno':[2140244,2140237,2140269,2140214,2140215],
   'Marks':{'English':[98,56,87,98,91],'Core':[91,67,89,75,31],
            'Elective':[91,98,54,67,87],'Second Language':[87,89,91,86,89]}}
per=[]
for j in range(0,len(d['Name'])):
    s=0
    for i in d['Marks']:
        s+=d['Marks'][i][j]
    p=s/len(d['Marks'])
    per.append(p)
d['Percentage']=per
d

{'Name': ['Akshat', 'Apurva', 'Janhvi', 'Somesh', 'Yash'],
 'Regno': [2140244, 2140237, 2140269, 2140214, 2140215],
 'Marks': {'English': [98, 56, 87, 98, 91],
  'Core': [91, 67, 89, 75, 31],
  'Elective': [91, 98, 54, 67, 87],
  'Second Language': [87, 89, 91, 86, 89]},
 'Percentage': [91.75, 77.5, 80.25, 81.5, 74.5]}

In [2]:
#import pandas
import pandas as pd
#to read a xlsx file
df1=pd.read_excel('employee_info.xlsx')
df1

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

In [13]:
import pandas as pd
#to read a xlsx file
df9=pd.read_csv('budget.csv')
df9

  Unnamed: 0  Year1   Year2  Year3
0    Person1  12545   97856  75423
1    Person2  25412  456782  46587
2    Person3  35978   95431  24563

In [10]:
#to read a csv file
df2=pd.read_csv('numbers.csv')
df2

   Number  Squared
0       2        4
1       6       36
2       9       81
3      10      100
4      12      144
5      15      225

### head(): displays the first 5 rows of the data

In [12]:
df1.head()

  Unnamed: 0  Year1   Year2  Year3
0    Person1  12545   97856  75423
1    Person2  25412  456782  46587
2    Person3  35978   95431  24563

### tail():  displays the last 5 rows of the data

In [14]:
df2.tail()

   Number  Squared
1       6       36
2       9       81
3      10      100
4      12      144
5      15      225

### shape(): checks the shape of the data using the shape atrribute

In [16]:
df1.shape

(3, 4)

### dtypes() : checks the data type of each variable in the data using the data attribute

In [18]:
df1.dtypes

Unnamed: 0    object
Year1          int64
Year2          int64
Year3          int64
dtype: object

In [3]:
df1.describe()

              Year1          Year2         Year3
count      3.000000       3.000000      3.000000
mean   24645.000000  216689.666667  48857.666667
std    11735.313758  207929.595177  25505.917849
min    12545.000000   95431.000000  24563.000000
25%    18978.500000   96643.500000  35575.000000
50%    25412.000000   97856.000000  46587.000000
75%    30695.000000  277319.000000  61005.000000
max    35978.000000  456782.000000  75423.000000

### To select a single column, use square brackets[] with the coulmn name of the column

In [6]:
df1["Age"]

0    45
1    12
2    54
3    26
4    64
5    21
Name: Age, dtype: int64

In [4]:
df1[["Age", "Salary"]]

   Age  Salary
0   45   40000
1   12       0
2   54  150000
3   26   30000
4   64   15000
5   21   25600

In [5]:
df1[df1["Age"]>30]

   Age  Gender  Salary
0   45    Male   40000
2   54  Female  150000
4   64  Female   15000

In [6]:
df1[df1["Gender"]=="Male"]

   Age Gender  Salary
0   45   Male   40000
1   12   Male       0
3   26   Male   30000

### .loc[ ] and .iloc[ ]

In [7]:
df1.loc[0]

Age          45
Gender     Male
Salary    40000
Name: 0, dtype: object

In [8]:
df1.iloc[0]

Age          45
Gender     Male
Salary    40000
Name: 0, dtype: object

In [9]:
df1.loc[1]

Age         12
Gender    Male
Salary       0
Name: 1, dtype: object

In [12]:
df1.loc[0:3] #displays the coloumn

   Age  Gender  Salary
0   45    Male   40000
1   12    Male       0
2   54  Female  150000
3   26    Male   30000

In [13]:
df1.loc[0:1,"Age"]

0    45
1    12
Name: Age, dtype: int64

In [15]:
df1.loc[3,"Age"]

26

In [16]:
df1.loc[[1,2,3]]

   Age  Gender  Salary
1   12    Male       0
2   54  Female  150000
3   26    Male   30000

In [17]:
df1.loc[[1,2,3] , ['Age', 'Gender']]

   Age  Gender
1   12    Male
2   54  Female
3   26    Male

In [19]:
df1.loc[df1["Age"]>30, "Salary"]

0     40000
2    150000
4     15000
Name: Salary, dtype: int64

In [20]:
df1.iloc[0] #cannot use column names and conditions in iloc function

Age          45
Gender     Male
Salary    40000
Name: 0, dtype: object

In [22]:
df1.iloc[3:6] #retrieve the 4th, 5th, 6th row in the data frame using the iloc function

   Age  Gender  Salary
3   26    Male   30000
4   64  Female   15000
5   21  Female   25600

In [23]:
df1.iloc[3:6,0]

3    26
4    64
5    21
Name: Age, dtype: int64

In [24]:
df1.iloc[3:6,0:2]

   Age  Gender
3   26    Male
4   64  Female
5   21  Female

In [30]:
sum(df1.loc[0:4,"Age"])/5.0

40.2

In [35]:
sum(df1.loc[0:4,"Age"])/len((df1.loc[0:4,"Age"]))

40.2

In [3]:
df1.loc[0][["Age","Gender"]]

Age         45
Gender    Male
Name: 0, dtype: object

In [4]:
df1.iloc[0][["Age","Gender"]]

Age         45
Gender    Male
Name: 0, dtype: object

In [3]:
df1[["Age", "Salary"]]

   Age  Salary
0   45   40000
1   12       0
2   54  150000
3   26   30000
4   64   15000
5   21   25600

In [5]:
d=df1.loc[0]
d

Age          45
Gender     Male
Salary    40000
Name: 0, dtype: object

In [6]:
df1.iloc[0:4][["Age","Gender"]]

   Age  Gender
0   45    Male
1   12    Male
2   54  Female
3   26    Male

In [7]:
d[0:2]["Age"]

45

In [9]:
df1.iloc[df1["Age"]>30][["Age", "Gender"]]

NotImplementedError: iLocation based boolean indexing on an integer type is not available

In [3]:
infile=open('budget.csv')
import csv
table=[]
for row in csv.reader(infile):
    table.append(row)
infile.close()
table
pprint.pprint(table)

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', '12545', '97856', '75423'],
 ['Person2', '25412', '456782', '46587'],
 ['Person3', '35978', '95431', '24563']]

In [5]:
for r in range(1,len(table)):
    for c in range(1,len(table[0])):
        table[r][c]=float(table[r][c])
pprint.pprin(table)

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', 12545.0, 97856.0, 75423.0],
 ['Person2', 25412.0, 456782.0, 46587.0],
 ['Person3', 35978.0, 95431.0, 24563.0]]

In [4]:
import pprint
pprint.pprint(table)

[['', 'Year1', 'Year2', 'Year3'],
 ['Person1', '12545', '97856', '75423'],
 ['Person2', '25412', '456782', '46587'],
 ['Person3', '35978', '95431', '24563']]